## Pandas
It's data science library - deals hetrogeneous data - mix of text, numbers, etc...

Panda has 3 different data structures.
- Series  - 1 dimensional 
- Data Frames - 2 dimensional (like excel sheet data which is 2 dimensional - rows x cols)
- Panel Data - Deprecated (Panda name had originates from Panel Data)
- Multi-Indexing - 3 dimensional

**Note**: Panda uses numpy under the hood.

https://pandas.pydata.org

In [ ]:
# Install pandas
! pip install pandas

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
# Create series data (You can perform array operations on it)
s1 = pd.Series([1, 2, 2.3, 45, 5])
print(s1)
print(s1[0:2])
print(type(s1))

# first column represents index

In [ ]:
# Creating Series
data = {1:10, 2: 20, 3: 50, 4: 55}
s2 = pd.Series(data)
print(s2)

s3 = pd.Series(np.arange(10), index=np.arange(10, 110, 10))
print(s3)

In [ ]:
# Time-Series Data (Here, Index is DataTime)
s4 = pd.Series(np.array(['10 F', '11 F', '20 F', '15 F', '12 F']), index=np.array(['10/10/2024 01 AM', '10/10/2024 02 AM', '10/10/2024 03 AM', '10/10/2024 04 AM', '10/10/2024 05 AM']))

print(s4)

#slicing the data using index
print(s4['10/10/2024 03 AM':])

In [ ]:
# Creating Data Frame
df1 = pd.DataFrame([['krishna', 10000, 20], ['Rahul', 12000, 32], ['Sahil', 20000, 25]])
df1

In [ ]:
data = {
    'name': ['krishna', 'rahul', 'sahil','rakesh','ramu'],
    'salary': [10000, 12000, 20000, 40000, 25000],
    'age': [20, 32, 25, 40, 25]
}

df2 = pd.DataFrame(data)
df2

In [ ]:
# Create df from series
df3 = pd.DataFrame(s4)
df3

#### Access by Columns

In [ ]:
# Access by column
df2['salary'] =  df2['salary'] + 1000
df2

#### Access by Rows

In [1]:
# Access by Rows
# iloc - locate by index / integer
# lock - locate by name

print(df2.iloc[1])
print(df2.iloc[1]['name'])
print(df2.iloc[1,0])
print(df2.loc[1,'name']) #row 1, column=name
df2.loc[1,'name'] = 'Renu'
print(df2.loc[1:,'name'])

NameError: name 'df2' is not defined

In [ ]:
df2['net_salary'] = df2.salary - 0.5 * df2.salary

df2

In [ ]:
df2.loc[0:, 'net_salary'] = df2.salary - 0.10 * df2.salary
df2

In [ ]:
# printing a series from a data frame
df2.name

In [ ]:
## Filtering on Data Frame

print('Filter the records with age=25')
df2[df2.age == 25]

Filter the records with age=25
Filter the records with age less than 35 and salary less than 20000

      name  salary  age  net_salary
0  krishna   10000   20      9000.0
1    rahul   12000   32     10800.0

In [ ]:
print('Filter the records with age less than 35 and salary less than 20000')
df2[(df2.age <= 35) & (df2.salary < 20000)]

Filter the records with age less than 35 and salary less than 20000

      name  salary  age  net_salary
0  krishna   10000   20      9000.0
1    rahul   12000   32     10800.0

In [ ]:
print('Filter the records with age less than 35 and salary less than 20000')
cond1 = df2.age <= 35
cond2 = df2.salary < 20000
df2[cond1 & cond2]

df2[cond1 | cond2]

Filter the records with age less than 35 and salary less than 20000

      name  salary  age  net_salary
0  krishna   10000   20      9000.0
1    rahul   12000   32     10800.0
2    sahil   20000   25     18000.0
4     ramu   25000   25     22500.0

In [ ]:
print('Filter the records with age!=25')
df2[~(df2.age == 25)]

Filter the records with age!=25

      name  salary  age  net_salary
0  krishna   10000   20      9000.0
1    rahul   12000   32     10800.0
3   rakesh   40000   40     36000.0